[
  {
    "author": "Straits Times",
    "title": "George Goh submits eligibility papers for Presidential Election, says 5 firms he heads have shareholders' equity of over S$1.5b",
    "content": "SINGAPORE — After submitting his application for a certificate of eligiblity to contest the coming Presidential Election, Harvey Norman Ossia founder George Goh said on Friday (Aug 4) that he is a 'serious candidate', pointing to his group of five companies with a combined shareholders' equity of more than S$1.5 billion over three years. Declining to name the companies, Mr Goh said that all five of them have been profitable every year for the last three years. This is the first time that Mr Goh has mentioned these five firms. Previously, the 65-year-old entrepreneur had said that his companies have a “collective market capitalisation value of S$3.15 billion”. Speaking at a press conference at Sheraton Towers after submitting his papers, Mr Goh said that he has planned for this day since 2017, when he first heard the changes to the eligibility criteria for private sector candidates. 'They are very stringent conditions; very few people can qualify,' he said. Under the previous requirements, candidates must have served as chairman or chief executive officer (CEO) of a company with at least S$100 million in paid-up capital. With the 2016 change, prospective candidates now must have served as the CEO of one company, or be the most senior executive running the firm, for at least three years. In addition, the company must have at least S$500 million in shareholders’ equity during the person's most recent three-year period as CEO and have been profitable after tax for the entire time that the candidate served as CEO. Providing a breakdown of the numbers, Mr Goh said that the combined profits after tax from the five companies over the past three years was S$377 million. The total shareholders' equity for these companies for the past three years is S$1.521 billion, with an average yearly shareholders' equity of S$507 million. Mr Goh said that he is the most senior executive in each of these companies. In response to a question from the media about why he is confident he will qualify through the deliberative track, Mr Goh reiterated that he fulfils the Presidential Elections Committee's considerations of being the most senior executive of a company, as well as running profitable companies over three years with shareholders' equity of at least S$500 million. On the point of being the most senior executive, Mr Goh said that a candidate cannot be 'number two'.  'If I am the CIO (chief investment officer) in my organisation for the private sector, please don't come forward because the CIO most likely ranks number five or six in the organisation,' he said, in a thinly veiled jibe at fellow presidential hopeful Ng Kok Song, who was formerly chief investment officer at sovereign wealth fund GIC. Mr Goh added the chairman is ranked first followed by the deputy chairman, chief executive officer, chief financial officer, chief operating officer and then the CIO.  'If I am in this position in the private sector company you cannot (apply), you have to be the most senior person to apply,' he said.  The chief investment officer position is not in the list of public service roles that qualify for the presidency. Mr Ng had said that he is intending to qualify through the 'public sector deliberative track' in the Constitution. This track is for candidates who claim to have the experience and ability comparable to that of those who automatically qualify, and can effectively carry out the functions and duties of the President. The other contestants vying for the top job are former Senior Minister Tharman Shanmugaratnam and former NTUC Income chief Tan Kin Lian. Mr Goh said that public sector candidates are 'very fortunate' as they do not need to worry about their profits when applying to contest the presidency. 'If you (a public sector candidate) are making a loss, you can still walk into the Istana. For the private sector, if you do not make a profit, you go home. There's no point to even talk about going to the ELD,' he said, referring to Elections Department Singapore. On why he did not disclose the name of the five companies, Mr Goh said that fake news is rife. 'I do not want a situation where people put pressure on the company and put out all kinds of things in the market. Then I am not a responsible CEO,' he said. Another question posed to Mr Goh was regarding comments that his lack of experience in the Government leaves him at a disadvantage. In response, he said that in the private sector, one not only manages the operational side of things but also how the company can extend its investments abroad. To do this, running a business also involves understanding politics, he said. Also on the panel at Mr Goh's press conference were his wife Lysa Goh and 10 other people, including former editor of national daily The Straits Times Han Fook Kwang, Malay-Muslim hawker Hajjah Roziah Adon and Mr Goh's niece, Ms Alicia Cheong, who is an education entrepreneur.  However, Mr Goh said that they are not his proposer, seconder and assenters, but rather the 'ordinary heroes'. 'These are the people who represent 80 to 90 per cent of Singaporeans,' he said. Mrs Goh said that she has fully supported her husband since she first heard his plans in 2017 because she knew his heart was 'for the people'. 'And I've been following him to many events because we work as a team, we have always been,' she said. Mrs Goh added that she also had to prepare the family by having 'honest conversations' with their children."
  },
  {
    "author": "Straits Times",
    "title": "Hong Kong star Coco Lee’s husband Bruce Rockowitz speaks out after singer’s fans confront him at cremation service",
    "content": "The husband of late Hong Kong pop diva Coco Lee has defended himself against accusations from her fans that he was responsible for her depression and death and said that he had nothing to do with her decision to end her life. 'I have 100 per cent nothing to do with her death,' Mr Bruce Rockowitz told the Post on Tuesday (Aug 1). He was speaking after fans of the star confronted him at the Cape Collinson Crematorium in Chai Wan earlier in the day and blamed him for the suicide attempt that led to Lee’s death. The finale of a two-day funeral descended into chaos in the late morning when several fans from mainland China hurled abuse at him, calling him a 'murderer' and someone with 'no conscience', and demanding that he' 'give me back my Coco’. Mr Rockowitz told the Post: 'I don’t know what was said to me during the cremation because I don’t know Chinese very well. That was not very nice.' The businessman, 64, who arrived in Hong Kong in the late 1970s, said his relationship with Lee, who was 48, lasted for 20 years before she took her own life earlier this month. They were married in a glamorous ceremony in 2011, attended by celebrities from the city and abroad. 'We have a 20-year relationship. No relationship is 100 per cent perfect,' he said. Rockowitz said in an earlier interview with the Post that he came to Hong Kong in 1979 aged 20 after the Hong Kong Country Club hired him as a tennis pro. He was in the middle of a course at a college in Boston, United States, at the time. Mr Rockowitz later got to know Mr Allan Zeman, the father of the Lan Kwai Fong entertainment area in Central, and became his business partner in a supply chain management venture. Mr Rockowitz is also the co-founder of the Pure Group fitness chain and a director of technology consultancy firm Step Digital Group. The Lee family earlier said the singer died on July 5 after she tried to take her own life on July 2. A source familiar with the circumstances said Lee moved out of her home and checked into a serviced flat at the Four Seasons Hotel in Central in October last year. The source said she felt unwell on June 30 and stayed in hospital for a day, before moving in with her sister on The Peak, where she later made the suicide attempt. The insider explained Lee had leg surgery in February this year and needed to take medication. But he said she did not appear to have suicidal tendencies at the time. Mr Rockowitz had minimal contact with Lee’s sisters, Nancy and Carol, at the funeral service. He and his two daughters from a previous marriage were in the second row near the altar at the funeral home. A distance was maintained between the trio and the Lee sisters. The service on Tuesday morning was closed to the public, with only Lee’s family, friends and 200 fans present. Hundreds of people said farewell to the star after the Hong Kong Funeral Home opened its doors to the public after a private service. Mr Rockowitz issued a statement last Thursday to deny allegations made in the media that sought 'to boost traffic'. He said the claims had damaged his reputation, as well as his family’s, and had affected their lives. Mr Rockowitz also emphasised he and his late wife’s financial affairs were separate throughout their marriage and said he had not, and would not, be involved in dealing with her estate. Lee was the first Chinese singer to be signed by Sony Music globally, as well as the first and only Chinese artist to perform at the Oscars, singing 'A Love Before Time' from Ang Lee’s 2000 award-winning film Crouching Tiger, Hidden Dragon."
  }
]
